app/controllers/redirection_controller.rb

SELECT "tags".* FROM "tags" WHERE (data = 1234567890)
---
  def index
     #Recupère lien courant correspondant au QRcode
	qrcode_id = params[:id]
	puts "YYYYYYYYYYYY"+qrcode_id
	if !qrcode_id.nil?
	  t = Tag.find(:all,:conditions => ["data = ?",qrcode_id])