app/controllers/tags_controller.rb

  def index
    user = User.find(session[:user_id])

    @tags = user.tags.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @tag = Tag.find(params[:id])
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @tag = Tag.new(params[:tag])
    @tag.user_id = session[:user_id]
    respond_to do |format|
      if @tag.save
---
INSERT INTO "tags" ("created_at", "data", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Tue, 06 Sep 2011 19:21:54 UTC +00:00], ["data", "123456789"], ["updated_at", Tue, 06 Sep 2011 19:21:54 UTC +00:00], ["url", "www.guitarnoize.com"]]

  def update
    @tag = Tag.find(params[:id])

    respond_to do |format|
      if @tag.update_attributes(params[:tag])
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tags" SET "url" = 'http://www.guitarnoize.com', "updated_at" = '2011-09-06 19:59:20.193000' WHERE "tags"."id" = 1