app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :email)
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def create
    @user = User.new(params[:user])

	@tag = Tag.new
	@tag.data = params[:data]
	@tag.url = "http://bydefault.fr"
	puts "____________params[:data]"+params[:data]
	@tag.save

	#if @tag.save
	#	@user.tags[@user.tags.size - 1] = @tag
	#else
	#end

    respond_to do |format|
      if @user.save
---
INSERT INTO "tags" ("created_at", "data", "id_user", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("created_at", "email", "hashed_password", "salt", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "salt" = '344366640.24204737548381583', "hashed_password" = 'a1889e8cec2a02d37aaf6021f31590d1c2c55319', "updated_at" = '2011-09-07 10:13:29.456400' WHERE "users"."id" = 1